InformationRegisters/доп_БитфонНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_БитфонНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ПрофилиНастроекБИТPhone</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CallerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_Протоколы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалПеререгистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоопределениеNAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ФорматЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлубинаИсторииЗвонков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксВыходаНаВнешнююЛинию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрямойНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьКомандуНеБеспокоитьНаАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаОтменаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийВерсия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийНеИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийCID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытияПриВнутреннихЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегдаЗаписыватьРазговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучатьЗаписиРазговоровСБИТАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.доп_ТелефонныеСтанцииБитАТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьОтправкаСМСОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЛоггирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтозапускПриСтартеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазворачиватьОкноПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьКартуЯндексПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредлагатьСохранитьНеизвестныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучениеСтатусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИскатьКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоискДублей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТипПриемаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_УдалитьТипПриемаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПереводаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.доп_ТипПереводаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаСтатусаНомераПередПереводом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНесколькоВходящих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьОтклоненныйПриРазговореВходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RTPПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетекторАктивностиМикрофона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокКодеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстройствоВыводаЗвукаВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешенныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСофтфона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/доп_СпискиОбзвона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>доп_СпискиОбзвона</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Список</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.доп_СписокОбзвона</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/доп_ПрофилиНастроекБИТPhone.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>доп_ПрофилиНастроекБИТPhone</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>доп_АТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Манго</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UISCOM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скорозвон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/доп_Протоколы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>доп_Протоколы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>UDP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TCP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/доп_ФорматЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>доп_ФорматЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>wav</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>mp3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>gsm</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/доп_БитфонСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Общий серверный модуль ОЛИМП.Phone софтфон
// Содержит функции, не зависящие от конфигурации.
///////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВерсиюВнешнейКомпоненты() ЭКСПОРТ
	Возврат "2.2.251";
КонецФункции

//-----------------------------------------------------------------------------
Функция ЗаписатьОшибкуВЖурналРегистрации(стрОшибка, стрОписание) ЭКСПОРТ
	доп_ТелефонияСервер.ЗаписатьОшибкуВЖурналРегистрации("ОЛИМП.Phone", стрОшибка, стрОписание);
КонецФункции

// Возвращаемое значение - булево,
//   Истина если в регистре сведений есть настройки для текущего пользователя.
Функция ПроверитьНастройкиТекущегоПользователя() ЭКСПОРТ
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	доп_БитфонНастройки.АдресСервера,
	               |	доп_БитфонНастройки.Логин,
	               |	доп_БитфонНастройки.Пароль
	               |ИЗ
	               |	РегистрСведений.доп_БитфонНастройки КАК доп_БитфонНастройки
	               |ГДЕ
	               |	доп_БитфонНастройки.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", доп_ТелефонияСервер.ПолучитьТекущегоПользователя());
	резт = Запрос.Выполнить();
	Если резт.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	табл = резт.Выгрузить();
	строкаРезт = табл[0];
	настроен = ЗначениеЗаполнено(строкаРезт.АдресСервера) И ЗначениеЗаполнено(строкаРезт.Логин);
	Возврат настроен;
КонецФункции

Процедура ПроверитьПрофильНастроек() ЭКСПОРТ
	профильНастр = ПолучитьПрофильНастроек();
	Если НЕ ЗначениеЗаполнено(профильНастр) Тогда
		УстановитьНастройку("ПрофильНастроек", Перечисления.доп_ПрофилиНастроекБИТPhone.доп_АТС);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьRTPПортПоУмолчанию() ЭКСПОРТ
	Возврат 4000;
КонецФункции

Функция ПолучитьФлагАвтоопределениеNATПоУмолчанию() ЭКСПОРТ
	Возврат Истина;
КонецФункции

Процедура ЗаполнитьНастройкиПоУмолчаниюТекущегоПользователя(настройки) ЭКСПОРТ
	настройки.Пользователь					= доп_ТелефонияСервер.ПолучитьТекущегоПользователя();
	настройки.ПрофильНастроек				= Перечисления.доп_ПрофилиНастроекБИТPhone.доп_АТС;
	настройки.Протокол						= Перечисления.доп_Протоколы.UDP;
	настройки.ИнтервалПеререгистрации		= 300;
	настройки.АвтоопределениеNAT			= ПолучитьФлагАвтоопределениеNATПоУмолчанию();
	настройки.ФорматЗаписи					= Перечисления.доп_ФорматЗаписи.wav;
	настройки.КомандаПереадресации			= "#9";
	настройки.ГлубинаИсторииЗвонков			= 50;
	настройки.ПрефиксВыходаНаВнешнююЛинию	= доп_ТелефонияСервер.ПолучитьПрефиксВыходаНаВнешнююЛиниюПоУмолчанию();
	настройки.КомандаНеБеспокоить			= "*75";
	настройки.КомандаОтменаНеБеспокоить		= "*76";
	настройки.СерверЛицензийВерсия			= 1; // СЛ 2.0
	настройки.СерверЛицензийАдрес			= "127.0.0.1";
	настройки.СерверЛицензийПорт			= 10700;
	настройки.УровеньЛоггирования			= 4;
	настройки.РазворачиватьОкноПриВходящемЗвонке = Истина;
	настройки.ПредлагатьСохранитьНеизвестныйНомер	= Истина;
	настройки.ТипПереводаЗвонка				= Перечисления.доп_ТипПереводаЗвонка.Условный;
	настройки.ПроверкаСтатусаНомераПередПереводом	= Истина;
	настройки.RTPПорт						= ПолучитьRTPПортПоУмолчанию();
КонецПроцедуры

Функция ДоступнаРольБитФонДляПользователя() ЭКСПОРТ
	Возврат ПравоДоступа("Просмотр", Метаданные.Обработки.доп_Битфон);
КонецФункции

Функция ПолучитьПараметрыСоединения() ЭКСПОРТ
	Пользователь = доп_ТелефонияСервер.ПолучитьТекущегоПользователя();
	СтруктураОтбора = Новый Структура("Пользователь", Пользователь);
	Возврат РегистрыСведений.доп_БитфонНастройки.Получить(СтруктураОтбора);
КонецФункции

Функция ПолучитьПрофильНастроек() ЭКСПОРТ
	профильНастр = ПолучитьПараметрыСоединения().ПрофильНастроек;
	Возврат профильНастр;
КонецФункции

Функция ПолучитьНомерФакса() ЭКСПОРТ
	номерФакса = ПолучитьПараметрыСоединения().НомерФакса;
	Возврат номерФакса;
КонецФункции

Функция ПолучитьДиректориюЗаписанныхФайлов() ЭКСПОРТ
	настрДиректория = ПолучитьПараметрыСоединения().ДиректорияЗаписанныхФайлов;
	Возврат настрДиректория;
КонецФункции

Функция ПолучитьФорматЗаписи() ЭКСПОРТ
	форматЗап = ПолучитьПараметрыСоединения().ФорматЗаписи;
	Возврат форматЗап;
КонецФункции

Функция ПолучитьКомандуПереадресации() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаПереадресации;
	Возврат команда;
КонецФункции

Функция ПолучитьГлубинуИсторииЗвонков() ЭКСПОРТ
	глубина = ПолучитьПараметрыСоединения().ГлубинаИсторииЗвонков;
	Если глубина = 0 Тогда
		глубина = 50;
	КонецЕсли;
	Возврат глубина;
КонецФункции

Функция ПолучитьПрефиксВыходаНаВнешнююЛинию() ЭКСПОРТ
	префикс = ПолучитьПараметрыСоединения().ПрефиксВыходаНаВнешнююЛинию;
	Возврат префикс;
КонецФункции

Функция ПолучитьФлагИспользоватьПрямойНабор() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИспользоватьПрямойНабор;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагИспользоватьКомандуНеБеспокоитьНаАТС() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИспользоватьКомандуНеБеспокоитьНаАТС;
	Возврат флаг;
КонецФункции

Функция ПолучитьКомандуНеБеспокоить() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаНеБеспокоить;
	Возврат команда;
КонецФункции

Функция ПолучитьКомандуОтменаНеБеспокоить() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаОтменаНеБеспокоить;
	Возврат команда;
КонецФункции

Функция ПолучитьФлагРежимНеБеспокоить() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().РежимНеБеспокоить;
	Возврат флаг;
КонецФункции

Процедура УстановитьФлагРежимНеБеспокоить(включен) ЭКСПОРТ
	УстановитьНастройку("РежимНеБеспокоить", включен);
КонецПроцедуры

// Возвращаемое значение - целое неотрицательное число
// 0 - ОЛИМП Сервер Лицензий 1.6
// 1 - ОЛИМП Сервер Лицензий 2.0
Функция ПолучитьВерсиюСервераЛицензий() ЭКСПОРТ
	версияСЛ = ПолучитьПараметрыСоединения().СерверЛицензийВерсия;
	Возврат версияСЛ;
КонецФункции

Функция ПолучитьАдресСервераЛицензий() ЭКСПОРТ
	адрес = ПолучитьПараметрыСоединения().СерверЛицензийАдрес;
	Возврат адрес;
КонецФункции

Функция ПолучитьПортСервераЛицензий() ЭКСПОРТ
	порт = ПолучитьПараметрыСоединения().СерверЛицензийПорт;
	Возврат порт;
КонецФункции

Функция ПолучитьФлагСервераЛицензийНеИспользоватьПрокси() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СерверЛицензийНеИспользоватьПрокси;
	Возврат флаг;
КонецФункции

Функция ПолучитьCIDСервераЛицензий() ЭКСПОРТ
	ид = ПолучитьПараметрыСоединения().СерверЛицензийCID;
	Возврат ид;
КонецФункции

Функция ПолучитьУровеньЛоггирования() ЭКСПОРТ
	уровеньЛог = ПолучитьПараметрыСоединения().УровеньЛоггирования;
	Возврат уровеньЛог;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытиеВходящийЗвонок() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытиеПриВходящемЗвонке;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытиеИсходящийЗвонок() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытиеПриИсходящемЗвонке;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытияПриВнутреннихЗвонках() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытияПриВнутреннихЗвонках;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагВсегдаЗаписыватьРазговор() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ВсегдаЗаписыватьРазговор;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагПолучатьЗаписиРазговоровСБИТАТС() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПолучатьЗаписиРазговоровСБИТАТС;
	Возврат флаг;
КонецФункции

Функция ПолучитьАТС() ЭКСПОРТ
	настрАТС = ПолучитьПараметрыСоединения().АТС;
	Возврат настрАТС;
КонецФункции

Процедура ПолучитьПараметрыОтправкиСМС(стрСМСЛогин, стрСМСПароль) ЭКСПОРТ
	параметрыСоед = ПолучитьПараметрыСоединения();
	стрСМСЛогин = параметрыСоед.УдалитьОтправкаСМСЛогин;
	стрСМСПароль = параметрыСоед.УдалитьОтправкаСМСПароль;
КонецПроцедуры

Функция ПолучитьОтправителяСМСПоУмолчанию() ЭКСПОРТ
	отправитель = ПолучитьПараметрыСоединения().УдалитьОтправкаСМСОтправитель;
	Возврат отправитель;
КонецФункции

Функция ПолучитьФлагАвтостартаПриЗапускеСистемы() ЭКСПОРТ
	Если НЕ доп_ТелефонияСерверПереопределяемый.ЕстьВозможностьАвтозапуска() Тогда
		Возврат Ложь;
	КонецЕсли;
	флаг = ПолучитьПараметрыСоединения().АвтозапускПриСтартеСистемы;
	Возврат флаг;
КонецФункции	

Функция ПолучитьСвойНомер() ЭКСПОРТ
	номер = ПолучитьПараметрыСоединения().СвойНомер;
	Возврат номер;
КонецФункции  

Функция ПолучитьФлагРазворачиватьОкноПриВходящемЗвонке() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().РазворачиватьОкноПриВходящемЗвонке;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагОткрыватьКартуЯндексПриВходящемЗвонке() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ОткрыватьКартуЯндексПриВходящемЗвонке;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагПредлагатьСохранитьНеизвестныйНомер() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПредлагатьСохранитьНеизвестныйНомер;
	Возврат флаг;
КонецФункции

Функция ПолучитьВерсиюВнешнейКомпонентыТекущегоПользователя() ЭКСПОРТ
	версия = ПолучитьПараметрыСоединения().ВерсияСофтфона;
	Возврат версия;
КонецФункции

Процедура УстановитьВерсиюВнешнейКомпонентыТекущегоПользователя(стрВерсия) ЭКСПОРТ
	УстановитьНастройку("ВерсияСофтфона", стрВерсия);
КонецПроцедуры

Функция ПолучитьФлагПолучениеСтатусовАбонентов() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПолучениеСтатусов;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагНеИскатьКонтрагента() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().НеИскатьКонтрагента;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагПоискДублей() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПоискДублей;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагПриниматьНесколькоВходящих() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПриниматьНесколькоВходящих;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагСохранятьОтклоненныйПриРазговореВходящий() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СохранятьОтклоненныйПриРазговореВходящий;
	Возврат флаг;
КонецФункции  

Функция ПолучитьТипПереводаЗвонка() ЭКСПОРТ
	тип = ПолучитьПараметрыСоединения().ТипПереводаЗвонка;
	Если НЕ ЗначениеЗаполнено(тип) Тогда
		тип = Перечисления.доп_ТипПереводаЗвонка.Условный;
		УстановитьНастройку("ТипПереводаЗвонка", тип);
	КонецЕсли;
	Возврат тип;
КонецФункции 

Функция ПолучитьФлагПроверкаСтатусаНомераПередПереводом() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПроверкаСтатусаНомераПередПереводом;
	Возврат флаг;
КонецФункции

Функция ПолучитьСписокКодеков() ЭКСПОРТ
	список = ПолучитьПараметрыСоединения().СписокКодеков;
	Возврат список;
КонецФункции 

Процедура УстановитьСписокКодеков(стрСписок) ЭКСПОРТ
	УстановитьНастройку("СписокКодеков", стрСписок);
КонецПроцедуры

Функция ПолучитьУстройствоВыводаЗвукаВходящегоЗвонка() ЭКСПОРТ
	устройство = ПолучитьПараметрыСоединения().УстройствоВыводаЗвукаВходящегоЗвонка;
	Возврат устройство;
КонецФункции

Функция ПолучитьТипВходящегоЗвонка() ЭКСПОРТ
	тип = ПолучитьПараметрыСоединения().ТипВходящегоЗвонка;
	Возврат тип;
КонецФункции

Функция ПолучитьФайлВходящегоЗвонка() ЭКСПОРТ
	стрФайл = ПолучитьПараметрыСоединения().ФайлВходящегоЗвонка;
	Возврат стрФайл;
КонецФункции

Функция ПолучитьРазрешенныйАдрес() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().РазрешенныйАдрес;
	Возврат флаг;
КонецФункции

Процедура УстановитьРазрешенныйАдрес(стрРазрешенныйАдрес) ЭКСПОРТ
	УстановитьНастройку("РазрешенныйАдрес", стрРазрешенныйАдрес);
КонецПроцедуры

//-----------------------------------------------------------------------------
// Создание событий

// Возвращает ссылку на новый созданный документ события взаимодействия
Функция СоздатьСобытие(структПараметрыСобытия) ЭКСПОРТ
	длинаНомера = СтрДлина(структПараметрыСобытия.Номер);
	длинаВнешнегоНомера = доп_ТелефонияКлиентСервер.ПолучитьДлинуВнешнегоНомера();
	создаватьСобытияПриВнутреннихЗвонках = доп_БитфонСервер.ПолучитьФлагСоздаватьСобытияПриВнутреннихЗвонках();
	Если НЕ создаватьСобытияПриВнутреннихЗвонках И длинаНомера < длинаВнешнегоНомера Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(структПараметрыСобытия.Контрагент) Тогда
		// Контрагент не был найден - номер уже изменился, ожидается событие изменения номера и создание события в нем.
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат доп_ТелефонияСерверПереопределяемый.СоздатьСобытиеЗвонка(структПараметрыСобытия);
КонецФункции

//-----------------------------------------------------------------------------
Функция ПолучитьНомерДляОператора(стрНомер, контрагент, контактноеЛицо) ЭКСПОРТ
	стрНомер = "";
	
	структОтбор = Новый Структура("Пользователь", доп_ТелефонияСервер.ПолучитьТекущегоПользователя());
	выборка = РегистрыСведений.доп_СпискиОбзвона.Выбрать(структОтбор);
	Если НЕ выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокОбзвонаТекущий = выборка.Список;
	Если НЕ ЗначениеЗаполнено(СписокОбзвонаТекущий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	доп_СписокОбзвонаСписок.Ссылка,
	               |	доп_СписокОбзвонаСписок.НомерСтроки,
	               |	доп_СписокОбзвонаСписок.НомерТелефона,
	               |	доп_СписокОбзвонаСписок.Контрагент,
	               |	доп_СписокОбзвонаСписок.КонтактноеЛицо,
	               |	доп_СписокОбзвонаСписок.Обработан
	               |ИЗ
	               |	Документ.доп_СписокОбзвона.Список КАК доп_СписокОбзвонаСписок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.доп_СписокОбзвона КАК доп_СписокОбзвона
	               |		ПО доп_СписокОбзвонаСписок.Ссылка = доп_СписокОбзвона.Ссылка
	               |ГДЕ
	               |	доп_СписокОбзвона.Ссылка = &Ссылка
	               |	И доп_СписокОбзвонаСписок.Обработан = ЛОЖЬ";
	Запрос.УстановитьПараметр("Ссылка", СписокОбзвонаТекущий);
	выгрузка = Запрос.Выполнить().Выбрать();
	Если выгрузка.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Истина;
	КонецЕсли;
	
	выгрузка.Следующий();
	
	стрНомер			= выгрузка.НомерТелефона;
	контрагент			= выгрузка.Контрагент;
	контактноеЛицо		= выгрузка.КонтактноеЛицо;
	
	списокОбзвона = выгрузка.Ссылка;
	списокОбзвонаОб = списокОбзвона.ПолучитьОбъект();
	строка = списокОбзвонаОб.Список.Найти(выгрузка.НомерСтроки, "НомерСтроки");
	Если строка <> Неопределено Тогда
		строка.Обработан = Истина;
	КонецЕсли;
	списокОбзвонаОб.Записать();
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
КонецФункции

//-----------------------------------------------------------------------------
// Возвращаемое значение - структура, в которой поле Ключ указывает на запись настроек текущего пользователя.
Функция ПолучитьПараметрыОткрытияФормыНастроек() ЭКСПОРТ
	Возврат доп_ТелефонияСервер.ПолучитьПараметрыОткрытияФормыНастроек("доп_БитфонНастройки", "доп_БитфонСервер");
КонецФункции

//-----------------------------------------------------------------------------
Функция ОтправитьПочтовоеСообщениеВТехподдержку(стрТема, стрТекст, стрНаименованиеВложения, двоичнВложение, сообщение) ЭКСПОРТ
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	Письмо.Тема = стрТема;
	Текст = Письмо.Тексты.Добавить(стрТекст, ТипТекстаПочтовогоСообщения.ПростойТекст);
	Письмо.Отправитель = "BIT.Phonesupport@1cbit.ru";
	Письмо.ИмяОтправителя = "ОЛИМП.Phone техническая поддержка";
	
	Если двоичнВложение <> Неопределено Тогда
		Письмо.Вложения.Добавить(двоичнВложение, стрНаименованиеВложения);
	КонецЕсли;
	
	Письмо.Получатели.Добавить("bitphone@1cbit.ru");
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "mx.1cbit.ru";
	Профиль.ПортSMTP = 587;
	Профиль.ПользовательSMTP = "BIT.Phonesupport@1cbit.ru";
	Профиль.ПарольSMTP = "NYF7ayjyu";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Почта = Новый ИнтернетПочта;
	
	успешностьОтправки = Истина;
	 
	Попытка
		Почта.Подключиться(Профиль);
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Подключение к почтовому серверу ОЛИМП успешно установлено";
		
		Почта.Послать(Письмо);
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Письмо отправлено";
		
		Почта.Отключиться();
	Исключение
		успешностьОтправки = Ложь;
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Не удалось подключиться к почтовому серверу ОЛИМП - " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат успешностьОтправки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройку(стрНастройка, значениеНастройки)
	доп_ТелефонияСервер.УстановитьНастройкуТекущегоПользователя("доп_БитфонНастройки", "доп_БитфонСервер", стрНастройка, значениеНастройки);
КонецПроцедуры

#КонецОбласти
